import { Board } from "../../src/connect4";

export const emptyConnect4GameBoard: Board = [
  ["⚪️", "⚪️", "⚪️", "⚪️", "⚪️", "⚪️", "⚪️"],
  ["⚪️", "⚪️", "⚪️", "⚪️", "⚪️", "⚪️", "⚪️"],
  ["⚪️", "⚪️", "⚪️", "⚪️", "⚪️", "⚪️", "⚪️"],
  ["⚪️", "⚪️", "⚪️", "⚪️", "⚪️", "⚪️", "⚪️"],
  ["⚪️", "⚪️", "⚪️", "⚪️", "⚪️", "⚪️", "⚪️"],
  ["⚪️", "⚪️", "⚪️", "⚪️", "⚪️", "⚪️", "⚪️"],
];

export const gameBoardInProgress: Board  = [
  ["⚪️", "⚪️", "⚪️", "⚪️", "⚪️", "⚪️", "⚪️"],
  ["⚪️", "⚪️", "⚪️", "⚪️", "⚪️", "⚪️", "⚪️"],
  ["⚪️", "⚪️", "⚪️", "⚪️", "⚪️", "⚪️", "⚪️"],
  ["🔴", "🟡", "🔴", "🟡", "⚪️", "⚪️", "⚪️"],
  ["🔴", "🟡", "🔴", "🟡", "⚪️", "⚪️", "⚪️"],
  ["🔴", "🟡", "🔴", "🟡", "⚪️", "⚪️", "⚪️"],
];

export const gameBoardThirdColumnFull: Board  = [
  ["⚪️", "⚪️", "🔴", "⚪️", "⚪️", "⚪️", "⚪️"],
  ["⚪️", "⚪️", "🟡", "⚪️", "⚪️", "⚪️", "⚪️"],
  ["⚪️", "⚪️", "🔴", "⚪️", "⚪️", "⚪️", "⚪️"],
  ["🔴", "🟡", "🟡", "🔴", "🟡", "🔴", "🟡"],
  ["🟡", "🔴", "🔴", "🟡", "🔴", "🟡", "🔴"],
  ["🔴", "🟡", "🟡", "🔴", "🟡", "🔴", "🟡"],
];

export const gameBoardAlmostHorizontalVictoryOnBottomRow: Board  = [
  ["⚪️", "⚪️", "⚪️", "⚪️", "⚪️", "⚪️", "⚪️"],
  ["⚪️", "⚪️", "⚪️", "⚪️", "⚪️", "⚪️", "⚪️"],
  ["⚪️", "⚪️", "⚪️", "⚪️", "⚪️", "⚪️", "⚪️"],
  ["⚪️", "⚪️", "🟡", "⚪️", "⚪️", "⚪️", "⚪️"],
  ["⚪️", "⚪️", "🟡", "⚪️", "⚪️", "⚪️", "⚪️"],
  ["🔴", "🔴", "🔴", "⚪️", "⚪️", "🟡", "⚪️"],
];

export const gameBoardAlmostHorizontalVictoryOnBottomRowForBot: Board  = [
  ["⚪️", "⚪️", "⚪️", "⚪️", "⚪️", "⚪️", "⚪️"],
  ["⚪️", "⚪️", "⚪️", "⚪️", "⚪️", "⚪️", "⚪️"],
  ["⚪️", "⚪️", "⚪️", "⚪️", "⚪️", "⚪️", "⚪️"],
  ["⚪️", "⚪️", "🔴", "⚪️", "⚪️", "⚪️", "⚪️"],
  ["⚪️", "⚪️", "🔴", "⚪️", "⚪️", "🔴", "⚪️"],
  ["🟡", "🟡", "🟡", "⚪️", "⚪️", "🔴", "⚪️"],
];


export const gameBoardHorizontalVictoryOnBottomRow : Board = [
  ["⚪️", "⚪️", "⚪️", "⚪️", "⚪️", "⚪️", "⚪️"],
  ["⚪️", "⚪️", "⚪️", "⚪️", "⚪️", "⚪️", "⚪️"],
  ["⚪️", "⚪️", "🟡", "⚪️", "⚪️", "⚪️", "⚪️"],
  ["⚪️", "⚪️", "🟡", "⚪️", "⚪️", "⚪️", "⚪️"],
  ["⚪️", "⚪️", "🟡", "⚪️", "⚪️", "⚪️", "⚪️"],
  ["🔴", "🔴", "🔴", "🔴", "⚪️", "🟡", "⚪️"],
];

export const gameBoardVerticalVictory : Board = [
  ["⚪️", "⚪️", "⚪️", "⚪️", "⚪️", "⚪️", "🔴"],
  ["⚪️", "⚪️", "⚪️", "⚪️", "⚪️", "⚪️", "🔴"],
  ["⚪️", "⚪️", "🟡", "⚪️", "⚪️", "⚪️", "🔴"],
  ["⚪️", "⚪️", "🟡", "⚪️", "⚪️", "⚪️", "🔴"],
  ["⚪️", "⚪️", "🟡", "⚪️", "⚪️", "⚪️", "🟡"],
  ["⚪️", "🟡", "🔴", "🔴", "⚪️", "🟡", "🟡"],
];

export const gameBoardHorizontalVictoryOnBottomRowForBot : Board = [
  ["⚪️", "⚪️", "⚪️", "⚪️", "⚪️", "⚪️", "⚪️"],
  ["⚪️", "⚪️", "⚪️", "⚪️", "⚪️", "⚪️", "⚪️"],
  ["⚪️", "⚪️", "🔴", "⚪️", "⚪️", "⚪️", "⚪️"],
  ["⚪️", "⚪️", "🔴", "⚪️", "⚪️", "⚪️", "⚪️"],
  ["⚪️", "⚪️", "🔴", "⚪️", "⚪️", "⚪️", "⚪️"],
  ["🟡", "🟡", "🟡", "🟡", "⚪️", "🔴", "⚪️"],
];


export const gameBoardFourRedDiscsButNotConsecutive : Board = [
  ["⚪️", "⚪️", "⚪️", "⚪️", "⚪️", "⚪️", "⚪️"],
  ["⚪️", "⚪️", "⚪️", "⚪️", "⚪️", "⚪️", "⚪️"],
  ["⚪️", "⚪️", "🟡", "⚪️", "⚪️", "⚪️", "⚪️"],
  ["⚪️", "⚪️", "🟡", "⚪️", "⚪️", "⚪️", "⚪️"],
  ["⚪️", "⚪️", "🟡", "⚪️", "⚪️", "⚪️", "⚪️"],
  ["🔴", "🔴", "🟡", "🔴", "🔴", "⚪️", "⚪️"],
];

export const gameBoardHorizontalVictoryForPlayerTwoMiddleRow : Board = [
  ["⚪️", "⚪️", "⚪️", "⚪️", "⚪️", "⚪️", "⚪️"],
  ["⚪️", "⚪️", "⚪️", "⚪️", "⚪️", "⚪️", "⚪️"],
  ["🟡", "🟡", "🟡", "🟡", "🔴", "⚪️", "⚪️"],
  ["⚪️", "⚪️", "🟡", "⚪️", "⚪️", "⚪️", "⚪️"],
  ["⚪️", "⚪️", "🟡", "⚪️", "⚪️", "⚪️", "⚪️"],
  ["🔴", "🔴", "🟡", "🔴", "🔴", "⚪️", "⚪️"],
];